"AU Direct Debit" = "Ausztrál közvetlen beszedés";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "Alipay";

"BLIK" = "BLIK";

"Bacs Direct Debit" = "Bacs közvetlen beszedés";

"Bancontact" = "Bancontact";

"Bank" = "Bank";

"Boleto" = "Boleto";

"Card" = "Kártya";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Konbini" = "Konbini";

"Link" = "Link";

"NetBanking" = "NetBanking";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "SEPA beszedés";

"Sofort" = "Sofort";

"Swish" = "Swish";

"Timed out authenticating your payment method -- try again" = "Fizetési módjának hitelesítésénél időtúllépés történt, próbálja újra.";

"UPI" = "UPI";

"US Bank Account" = "USA bankszámla";

"Unknown" = "Ismeretlen";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Nem tudjuk hitelesíteni a fizetési módját. Kérjük, válasszon másik fizetési módot, és próbálkozzon újból.";

"WeChat Pay" = "WeChat Pay";

"giropay" = "giropay";

"iDEAL" = "iDEAL";
